In [1]:
import pandas as pd
import numpy as np

In [8]:
customer = pd.read_excel(r"C:\Users\Croma Campus\Downloads\Ecomm.xlsx" , sheet_name='CustomerDetail')

In [9]:
customer.shape

(24, 12)

In [10]:
order = pd.read_excel(r"C:\Users\Croma Campus\Downloads\Ecomm.xlsx" , sheet_name='Jan')

In [11]:
order.shape

(1952, 8)

In [12]:
customer.head(2)

,CustomerID,CustomerID.1,Order Date,Month,MonthName,DateInText,Customer Name,State or Province,City,Gender,Gender.1,Gender.2
0,CUS7253,7253,2015-01-07,1,Jan,01/07/2015,Bonnie Potter,Washington,Anacortes,M,1,MALE
1,CUS4875,4875,2015-06-13,6,Jun,06/13/2015,Ronnie Proctor,California,San Gabriel,F,0,FEMALE

In [13]:
order.head(2)

,Order ID,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,88522,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,90193,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card

In [14]:
customer.columns

Index(['CustomerID', 'CustomerID.1', 'Order Date', 'Month', 'MonthName',
       'DateInText', 'Customer Name', 'State or Province', 'City', 'Gender',
       'Gender.1', 'Gender.2'],
      dtype='object')

In [15]:
customer = customer.drop(columns=['CustomerID','Month','DateInText','Gender','Gender.1'])

In [18]:
customer.head(2)

,CustomerID.1,Order Date,MonthName,Customer Name,State or Province,City,Gender.2
0,7253,2015-01-07,Jan,Bonnie Potter,Washington,Anacortes,MALE
1,4875,2015-06-13,Jun,Ronnie Proctor,California,San Gabriel,FEMALE

In [21]:
customer = customer.rename(columns={'CustomerID.1':'CustomerID','Gender.2':'Gender'})

In [22]:
customer.head(2)

,CustomerID,Order Date,MonthName,Customer Name,State or Province,City,Gender
0,7253,2015-01-07,Jan,Bonnie Potter,Washington,Anacortes,MALE
1,4875,2015-06-13,Jun,Ronnie Proctor,California,San Gabriel,FEMALE

In [23]:
order.head(2)

,Order ID,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,88522,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,90193,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card

In [24]:
customer.isnull().sum()

CustomerID           0
Order Date           0
MonthName            0
Customer Name        0
State or Province    0
City                 0
Gender               0
dtype: int64

In [25]:
order.isnull().sum()

Order ID                0
CustomerID              0
Amount                  0
Profit                  0
Quantity ordered new    0
Product Category        0
Product Sub-Category    0
Payment Mode            0
dtype: int64

In [26]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   CustomerID         24 non-null     int64
 1   Order Date         24 non-null     datetime64[ns]
 2   MonthName          24 non-null     object
 3   Customer Name      24 non-null     object
 4   State or Province  24 non-null     object
 5   City               24 non-null     object
 6   Gender             24 non-null     object
dtypes: datetime64[ns](1), int64(1), object(5)
memory usage: 1.4+ KB

In [27]:
order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1952 entries, 0 to 1951
Data columns (total 8 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Order ID              1952 non-null   int64
 1   CustomerID            1952 non-null   int64
 2   Amount                1952 non-null   float64
 3   Profit                1952 non-null   float64
 4   Quantity ordered new  1952 non-null   int64
 5   Product Category      1952 non-null   object
 6   Product Sub-Category  1952 non-null   object
 7   Payment Mode          1952 non-null   object
dtypes: float64(2), int64(3), object(3)
memory usage: 122.1+ KB

In [29]:
print("Profit : ",order.Profit.sum())

Profit :  224114.64183714997

In [32]:
pbc = order.groupby('Product Category').agg({'Profit':'sum'}).reset_index()

In [33]:
pbc

  Product Category        Profit
0        Furniture  59249.445936
1  Office Supplies  89562.039537
2       Technology  75303.156364

In [34]:
order.head(2)

,Order ID,CustomerID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,88522,4666,11.36,4.5600,4,Office Supplies,Pens & Art Supplies,Credit Card
1,90193,4663,6011.76,4390.3665,12,Furniture,Chairs & Chairmats,Credit Card

In [40]:
pbsc = order.groupby('Product Sub-Category').agg({'Profit':'sum'}).reset_index()

In [41]:
pbsc

              Product Sub-Category        Profit
0                       Appliances  12594.820600
1   Binders and Binder Accessories  59296.389430
2                        Bookcases   -930.438400
3               Chairs & Chairmats  48695.836600
4             Computer Peripherals   1698.043980
5                  Copiers and Fax  23990.207580
6                        Envelopes  -1194.412500
7                           Labels   7028.159500
8               Office Furnishings  18724.119100
9                  Office Machines   8824.390564
10                           Paper   7769.315070
11             Pens & Art Supplies   -220.598800
12                    Rubber Bands  -1544.826063
13   Scissors, Rulers and Trimmers  -1291.095900
14          Storage & Organization   7124.288200
15                          Tables  -7240.071364
16    Telephones and Communication  40790.514240

In [42]:
pbsc[pbsc['Profit']>0]

              Product Sub-Category        Profit
0                       Appliances  12594.820600
1   Binders and Binder Accessories  59296.389430
3               Chairs & Chairmats  48695.836600
4             Computer Peripherals   1698.043980
5                  Copiers and Fax  23990.207580
7                           Labels   7028.159500
8               Office Furnishings  18724.119100
9                  Office Machines   8824.390564
10                           Paper   7769.315070
14          Storage & Organization   7124.288200
16    Telephones and Communication  40790.514240

In [46]:
df = customer.merge(order , on='CustomerID' , how="inner" )

In [47]:
df.head(2)

,CustomerID,Order Date,MonthName,Customer Name,State or Province,City,Gender,Order ID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,MALE,88522,11.36,4.560,4,Office Supplies,Pens & Art Supplies,Credit Card
1,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,MALE,90669,94.27,105.678,11,Office Supplies,"Scissors, Rulers and Trimmers",Credit Card

In [50]:
pbs = df.groupby('State or Province').agg({'Profit':'sum'}).reset_index()

In [51]:
pbs

  State or Province        Profit
0        California  31886.448316
1         Minnesota  34330.365504
2           Montana  15291.345669
3          New York  98143.568974
4            Oregon  44462.913374

In [53]:
pbsc = df.groupby(['State or Province','City']).agg({'Profit':'sum'}).reset_index()

In [54]:
pbsc

  State or Province           City        Profit
0        California  Laguna Niguel  11289.841504
1        California       Lakewood  20596.606812
2         Minnesota     Prior Lake  34330.365504
3           Montana         Helena  -2652.565420
4           Montana       Missoula  17943.911089
5          New York  New York City  46241.708660
6          New York      Smithtown  29362.161433
7          New York       Syracuse  22539.698882
8            Oregon    Grants Pass  32931.504260
9            Oregon        Gresham  11531.409114

In [56]:
df.head(2)

,CustomerID,Order Date,MonthName,Customer Name,State or Province,City,Gender,Order ID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,MALE,88522,11.36,4.560,4,Office Supplies,Pens & Art Supplies,Credit Card
1,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,MALE,90669,94.27,105.678,11,Office Supplies,"Scissors, Rulers and Trimmers",Credit Card

In [57]:
df.Gender.unique()

array(['MALE', 'FEMALE'], dtype=object)

In [58]:
df.Gender = df.Gender.map( lambda val:'Male' if val=='MALE' else 'Female' )

In [61]:
df.head(2)

,CustomerID,Order Date,MonthName,Customer Name,State or Province,City,Gender,Order ID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,Male,88522,11.36,4.560,4,Office Supplies,Pens & Art Supplies,Credit Card
1,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,Male,90669,94.27,105.678,11,Office Supplies,"Scissors, Rulers and Trimmers",Credit Card

In [60]:
df.Gender.unique()

array(['Male', 'Female'], dtype=object)

In [63]:
df.Profit = df.Profit.map( lambda val: round(val,2) )

In [64]:
df.head(4)

,CustomerID,Order Date,MonthName,Customer Name,State or Province,City,Gender,Order ID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode
0,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,Male,88522,11.36,4.56,4,Office Supplies,Pens & Art Supplies,Credit Card
1,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,Male,90669,94.27,105.68,11,Office Supplies,"Scissors, Rulers and Trimmers",Credit Card
2,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,Male,86297,285.84,-2177.99,9,Furniture,Tables,Credit Card
3,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,Male,89320,1982.14,1372.63,31,Furniture,Office Furnishings,Credit Card

In [76]:
df['Year'] = df['Order Date'].dt.year

In [77]:
df.head(2)

,CustomerID,Order Date,MonthName,Customer Name,State or Province,City,Gender,Order ID,Amount,Profit,Quantity ordered new,Product Category,Product Sub-Category,Payment Mode,Year
0,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,Male,88522,11.36,4.56,4,Office Supplies,Pens & Art Supplies,Credit Card,2015
1,4666,2015-05-12,May,Gwendolyn F Tyson,Minnesota,Prior Lake,Male,90669,94.27,105.68,11,Office Supplies,"Scissors, Rulers and Trimmers",Credit Card,2015

In [78]:
df['Year'].unique()

array([2015], dtype=int32)